app/Models/BillModel.php

SELECT *
FROM `bill`
WHERE `bill_id` = '17'
---
    public function readLastItem()
    {
        $this->builder->select('*');
        $this->builder->orderBy('bill_id', 'desc');

UPDATE `bill` SET `note` = 'TS trân châu đường đen: Bình thường; TS truyền thống: Thêm đường; TS Matcha: Nhiều đá; '
WHERE `bill_id` = '2'
---
    public function edit($where, $data)
    {
        $this->builder->where($where);
        return $this->builder->update($data);

SELECT COUNT(`bill_id`) AS `bill_id`
FROM `bill`
WHERE `bill_id` = '17'
---
    public function isAlreadyExist($where)
    {
        $this->builder->selectCount('bill_id');