app/Models/BillModel.php

    public function readLastItem()
    {
        $this->builder->select('*');
        $this->builder->orderBy('bill_id', 'desc');
        return $this->builder->get()->getResult()[0];
---
SELECT *
FROM `bill`
WHERE `bill_id` = '4'

    public function isAlreadyExist($where)
    {
        $this->builder->selectCount('bill_id');
---
SELECT COUNT(`bill_id`) AS `bill_id`
FROM `bill`
WHERE `bill_id` = '4'