app/Models/CatalogModel.php

SELECT COUNT(`catalog_id`) AS `catalog_id`
FROM `catalog`
WHERE `catalog_id` = '1'
---
    public function isAlreadyExist($where)
    {
        $this->builder->selectCount('catalog_id');