app/Models/FoodModel.php

SELECT *
FROM `food`
WHERE `food_id` = '3'
SELECT *
FROM `food`
ORDER BY `food_id` DESC
---
    public function readLastItem()
    {
        $this->builder->select('*');
        $this->builder->orderBy('food_id', 'desc');
        return $this->builder->get()->getResult()[0];

INSERT INTO `food` (`food_name`, `description`, `status`, `catalog_id`) VALUES ('Trà sữa truyền thống', 'Trà sữa truyền thống', 1, '1')
---
    public function create($data)
	{
        // Cách 1: Có thể truyền dữ liệu bằng phương thức: $this->builder->set('name', $name); Sau đó sử dụng $this->builder->insert();
        // cách 2: truyền vào mảng data cần insert
        return $this->builder->insert($data);

SELECT COUNT(`food_id`) AS `food_id`
FROM `food`
WHERE `food_id` = '76'
---
    public function isAlreadyExist($where)
    {
        $this->builder->selectCount('food_id');