app/Models/FoodSizeModel.php

    public function create($data)
	{
        // Cách 1: Có thể truyền dữ liệu bằng phương thức: $this->builder->set('name', $name); Sau đó sử dụng $this->builder->insert();
        // cách 2: truyền vào mảng data cần insert
        return $this->builder->insert($data);
---
INSERT INTO `food_size` (`price`, `promotion_price`, `description`, `food_id`, `size_unit_code`, `promotion_price_deadline`) VALUES (12000, 0, 'Trà sữa truyền thống (Vừa)', '1', '1:M', '')