app/Models/SizeUnitModel.php

    public function isAlreadyExist($where)
    {
        $this->builder->selectCount('size_unit_code');
        $this->builder->where($where);
        return (($this->builder->get()->getResult()[0]->size_unit_code) > 0) ? true : false;
---
SELECT COUNT(`size_unit_code`) AS `size_unit_code`
FROM `size_unit`
WHERE `size_unit_code` = '1:M'