app/Models/TableOrderModel.php

    public function isAlreadyExist($where)
    {
        $this->builder->selectCount('table_id');
---
SELECT COUNT(`table_id`) AS `table_id`
FROM `table_order`
WHERE `table_id` = '1'